# 오래전부터 많은 과학자들이 정보가 연결되어 있는 세계를 상상을 하였는데
# Norbert Wiener, 1894 ~ 1964  
# 사람의 신경작용에서 영감을 얻음 - > 인간, 기계 사회 전반에 서로 통신을 뜻하는 사이버네틱스 이론 시작함. 

# Vannevar Bush, 1890 ~ 1974 
# 연결된 데이터들이 들어있는 무한한 도서관을 예측.

# J.C.R Licklider, 1915 ~ 1990 

# 컴퓨터를 고안 > 온라인 공동체 개발 논의
# 고아역 네트워크 예측


# 이후 

# 미,영 전문간들은 패킷 교환을 만듬  packet switching

# 미 국방부에서 시작  Arpanet 

# 냉전 시대 1960, 미국 국방부 주도하에 시작 됨. 

# 정보 교환 > 연구역량을 극대화, 분산 네트워크로 하나가 붕괴되도 나머지는 영향 x 



# 이후 대학과 기업으로 퍼져감

# 그리고 일반인에게도 PC personal computer 보급 


# WWW World Wide Web 

# 팀 버너스 리가 고안 (유럽입자물리연구소CERN)

# HTML을 만듬(한 문서에서 다른 문서로 접근한다는 개념)

# 문서에 주소를 붙이는 URL

# 컴퓨터와 컴퓨터간데 메세지를 주고받을 수 있는 통신규약 HTTP 

# 전 세계 인터넷 콘텐츠를 연결해 공유할 수 있도록 하는 WWW 

# 세계 최초 웹사이트 http://info.cern.ch/



